<a href="https://colab.research.google.com/github/gyujin0450/RPRG_PartII/blob/master/p169_dplyr.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ch06 데이터 조작

In [ ]:
## dplyr 패키지 활용
# https://wsyang.com/2014/02/introduction-to-dplyr/
# https://machine-geon.tistory.com/34

In [6]:
# before dplyr
head(iris,5)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.9          3.0         1.4          0.2         setosa
3 4.7          3.2         1.3          0.2         setosa
4 4.6          3.1         1.5          0.2         setosa
5 5.0          3.6         1.4          0.2         setosa

In [2]:
install.packages("dplyr")
library(dplyr)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)


Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [8]:
# after dplyr : 파이프(%>%) 연산자를 이용한 함수 적용
iris %>% head(5)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.9          3.0         1.4          0.2         setosa
3 4.7          3.2         1.3          0.2         setosa
4 4.6          3.1         1.5          0.2         setosa
5 5.0          3.6         1.4          0.2         setosa

In [9]:
iris %>% head() %>% subset(Sepal.Length > 5.0)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
6 5.4          3.9         1.7          0.4         setosa

In [10]:
iris %>% subset(Sepal.Length > 5.0) %>% head()

   Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1  5.1          3.5         1.4          0.2         setosa
6  5.4          3.9         1.7          0.4         setosa
11 5.4          3.7         1.5          0.2         setosa
15 5.8          4.0         1.2          0.2         setosa
16 5.7          4.4         1.5          0.4         setosa
17 5.4          3.9         1.3          0.4         setosa

In [13]:
# 콘솔 창의 크그에 맞게 데이터 추출
install.packages(c("dplyr","fights"))

Installing packages into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Warning message:
“package ‘fights’ is not available (for R version 4.0.2)”

In [ ]:
# hfright 를 대체하는 패키지는 없나?

In [22]:
titanic <- read.csv('titanic3.csv')
str(titanic)

'data.frame':	1309 obs. of  14 variables:
 $ pclass   : int  1 1 1 1 1 1 1 1 1 1 ...
 $ survived : int  1 1 0 0 0 1 1 0 1 0 ...
 $ name     : chr  "Allen, Miss. Elisabeth Walton" "Allison, Master. Hudson Trevor" "Allison, Miss. Helen Loraine" "Allison, Mr. Hudson Joshua Creighton" ...
 $ sex      : chr  "female" "male" "female" "male" ...
 $ age      : num  29 0.92 2 30 25 48 63 39 53 71 ...
 $ sibsp    : int  0 1 1 1 1 0 1 0 2 0 ...
 $ parch    : int  0 2 2 2 2 0 0 0 0 0 ...
 $ ticket   : chr  "24160" "113781" "113781" "113781" ...
 $ fare     : num  211 152 152 152 152 ...
 $ cabin    : chr  "B5" "C22 C26" "C22 C26" "C22 C26" ...
 $ embarked : chr  "S" "S" "S" "S" ...
 $ boat     : chr  "2" "11" "" "" ...
 $ body     : int  NA NA NA 135 NA NA NA NA NA 22 ...
 $ home.dest: chr  "St Louis, MO" "Montreal, PQ / Chesterville, ON" "Montreal, PQ / Chesterville, ON" "Montreal, PQ / Chesterville, ON" ...

In [47]:
titanic %>% head(5)

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
3 1      0        Allison, Miss. Helen Loraine                    female  2.00
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
  sibsp parch ticket fare     cabin   embarked boat body
1 0     0     24160  211.3375 B5      S        2     NA
2 1     2     113781 151.5500 C22 C26 S        11    NA
3 1     2     113781 151.5500 C22 C26 S              NA
4 1     2     113781 151.5500 C22 C26 S             135
5 1     2     113781 151.5500 C22 C26 S              NA
  home.dest
1 St Louis, MO
2 Montreal, PQ / Chesterville, ON
3 Montreal, PQ / Chesterville, ON
4 Montreal, PQ / Chesterville, ON
5 Montreal, PQ / Chesterville, ON

In [66]:
titanic_df <- tbl_df(titanic)
titanic_df %>% head(5)
# tbl_df() : RStudio 에서는 R 콘솔 창 크기에서 볼 수 있는 만큼 보여줌!!
# Error in as_tibble(data, .name_repair = "check_unique") : 
#  객체 'titanic_df'를 찾을 수 없습니다
# 추가정보: 경고메시지(들): 
# `tbl_df()` is deprecated as of dplyr 1.0.0.
# Please use `tibble::as_tibble()` instead.

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
3 1      0        Allison, Miss. Helen Loraine                    female  2.00
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
  sibsp parch ticket fare     cabin   embarked boat body
1 0     0     24160  211.3375 B5      S        2     NA
2 1     2     113781 151.5500 C22 C26 S        11    NA
3 1     2     113781 151.5500 C22 C26 S              NA
4 1     2     113781 151.5500 C22 C26 S             135
5 1     2     113781 151.5500 C22 C26 S              NA
  home.dest
1 St Louis, MO
2 Montreal, PQ / Chesterville, ON
3 Montreal, PQ / Chesterville, ON
4 Montreal, PQ / Chesterville, ON
5 Montreal, PQ / Chesterville, ON

In [67]:
filter(titanic_df, pclass == 1 & survived == 0 ) %>% head(5)

  pclass survived name                                            sex    age
1 1      0        Allison, Miss. Helen Loraine                    female  2
2 1      0        Allison, Mr. Hudson Joshua Creighton            male   30
3 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25
4 1      0        Andrews, Mr. Thomas Jr                          male   39
5 1      0        Artagaveytia, Mr. Ramon                         male   71
  sibsp parch ticket   fare     cabin   embarked boat body
1 1     2     113781   151.5500 C22 C26 S              NA
2 1     2     113781   151.5500 C22 C26 S             135
3 1     2     113781   151.5500 C22 C26 S              NA
4 0     0     112050     0.0000 A36     S              NA
5 0     0     PC 17609  49.5042         C              22
  home.dest
1 Montreal, PQ / Chesterville, ON
2 Montreal, PQ / Chesterville, ON
3 Montreal, PQ / Chesterville, ON
4 Belfast, NI
5 Montevideo, Uruguay

In [68]:
arrange(titanic_df,desc(pclass),survived, age) %>% head(5)

  pclass survived name                                    sex    age  sibsp
1 3      0        Danbom, Master. Gilbert Sigvard Emanuel male   0.33 0
2 3      0        Peacock, Master. Alfred Edward          male   0.75 1
3 3      0        Goodwin, Master. Sidney Leonard         male   1.00 5
4 3      0        Klasen, Miss. Gertrud Emilia            female 1.00 1
5 3      0        Panula, Master. Eino Viljami            male   1.00 4
  parch ticket             fare    cabin embarked boat body
1 2     347080             14.4000       S             NA
2 1     SOTON/O.Q. 3101315 13.7750       S             NA
3 2     CA 2144            46.9000       S             NA
4 1     350405             12.1833       S             NA
5 1     3101295            39.6875       S             NA
  home.dest
1 Stanton, IA
2
3 Wiltshire, England Niagara Falls, NY
4
5

In [69]:
select(titanic_df, pclass, survived, age) %>% head(5)

  pclass survived age
1 1      1        29.00
2 1      1         0.92
3 1      0         2.00
4 1      0        30.00
5 1      0        25.00

In [71]:
mutate(titanic_df, pclass_survived = pclass + survived) %>% head(5)

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
3 1      0        Allison, Miss. Helen Loraine                    female  2.00
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
  sibsp parch ticket fare     cabin   embarked boat body
1 0     0     24160  211.3375 B5      S        2     NA
2 1     2     113781 151.5500 C22 C26 S        11    NA
3 1     2     113781 151.5500 C22 C26 S              NA
4 1     2     113781 151.5500 C22 C26 S             135
5 1     2     113781 151.5500 C22 C26 S              NA
  home.dest                       pclass_survived
1 St Louis, MO                    2
2 Montreal, PQ / Chesterville, ON 2
3 Montreal, PQ / Chesterville, ON 1
4 Montreal, PQ / Chesterville, ON 1
5 Montreal, PQ / Chesterville, ON 1

In [72]:
summarise(titanic_df, avgAge = mean(age, na.rm = TRUE))

  avgAge
1 29.88114

In [3]:
## 집단변수 대상 그룹화
# group_by(dataframe, 집단변수)
species <- group_by(iris, Species)
str(species)
# tibble : http://blog.naver.com/PostView.nhn?blogId=2000051148&logNo=221188223533&parentCategoryNo=&categoryNo=52&viewDate=&isShowPopularPosts=true&from=search

tibble [150 × 5] (S3: grouped_df/tbl_df/tbl/data.frame)
 $ Sepal.Length: num [1:150] 5.1 4.9 4.7 4.6 5 5.4 4.6 5 4.4 4.9 ...
 $ Sepal.Width : num [1:150] 3.5 3 3.2 3.1 3.6 3.9 3.4 3.4 2.9 3.1 ...
 $ Petal.Length: num [1:150] 1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 ...
 $ Petal.Width : num [1:150] 0.2 0.2 0.2 0.2 0.2 0.4 0.3 0.2 0.2 0.1 ...
 $ Species     : Factor w/ 3 levels "setosa","versicolor",..: 1 1 1 1 1 1 1 1 1 1 ...
 - attr(*, "groups")= tibble [3 × 2] (S3: tbl_df/tbl/data.frame)
  ..$ Species: Factor w/ 3 levels "setosa","versicolor",..: 1 2 3
  ..$ .rows  : list<int> [1:3]
  .. ..$ : int [1:50] 1 2 3 4 5 6 7 8 9 10 ...
  .. ..$ : int [1:50] 51 52 53 54 55 56 57 58 59 60 ...
  .. ..$ : int [1:50] 101 102 103 104 105 106 107 108 109 110 ...
  .. ..@ ptype: int(0)
  ..- attr(*, ".drop")= logi TRUE

In [6]:
# species

In [75]:
# 비교 : ???
str(iris)

'data.frame':	150 obs. of  5 variables:
 $ Sepal.Length: num  5.1 4.9 4.7 4.6 5 5.4 4.6 5 4.4 4.9 ...
 $ Sepal.Width : num  3.5 3 3.2 3.1 3.6 3.9 3.4 3.4 2.9 3.1 ...
 $ Petal.Length: num  1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 ...
 $ Petal.Width : num  0.2 0.2 0.2 0.2 0.2 0.4 0.3 0.2 0.2 0.1 ...
 $ Species     : Factor w/ 3 levels "setosa","versicolor",..: 1 1 1 1 1 1 1 1 1 1 ...

In [7]:
# iris

In [ ]:
## 데이터프레임 병합
# inner_join(dataframe1, dataframe2, 공통변수 )